#ifndef __INTEGRATOR_KBD_HANDLER_H__
#define __INTEGRATOR_KBD_HANDLER_H__

#include "KbdHandler/BaseKbdHandler.h"

//--------------------------------------------------------------------
// Класс обработчик комманд с консоли
//--------------------------------------------------------------------
class GivsKbdHandler : public BaseKbdHandler
{
public:
	//--------------------------------------------------------------------
	// Constructor.
	//--------------------------------------------------------------------
	GivsKbdHandler (void);
	
	//--------------------------------------------------------------------
	// Destructor.
	//--------------------------------------------------------------------
	virtual ~GivsKbdHandler (void);

	//--------------------------------------------------------------------
	// Обрабатывает комманды полученные с консоли
	// Вход 
	//	Command - комманда для выполнения
	// Выход 
	//	результат функции - обработана комманда или нет
	//--------------------------------------------------------------------
	virtual bool ProcessCommand(TStdStringList Command);

  //---------------------------------------------------------------------------
  // Показывает статус сервера и текущую версию сервера 
  //---------------------------------------------------------------------------
  virtual void ShowServerStatus(void);

protected:

	//--------------------------------------------------------------------
	// Возвращает текстовую строку для хелпа
	//--------------------------------------------------------------------
	std::string GetHelpText();

	//--------------------------------------------------------------------
	// Показать список названий сертификатов
	//--------------------------------------------------------------------
	//virtual int CertList(TStdStringList Command);

	//--------------------------------------------------------------------
	// Обнавить список названий сертификатов
	//--------------------------------------------------------------------
	//virtual int UpdatePayment(TStdStringList Command);

	//--------------------------------------------------------------------
	// Создать документ с реестром платежей
	//--------------------------------------------------------------------
	//virtual int PaySheet (TStdStringList Command);

};

#endif // __INTEGRATOR_KBD_HANDLER_H__
