#ifndef __INTEGRATOR_PARAMETRS_H__
#define __INTEGRATOR_PARAMETRS_H__

#include "Server/BaseParametrs.h"

// ------------------------------------------------------------
// Класс для работы с параметрами конфигурации сервера
// ------------------------------------------------------------

class  TGivsParametrs : public TBaseParametrs {
public:
	//------------------------------------------------------------
	// Конструктор
	//------------------------------------------------------------
	TGivsParametrs(std::string aParamsFileName);

	//------------------------------------------------------------
	// Деструктор
	//------------------------------------------------------------
	~TGivsParametrs();

	//////////////////////////////////////////////////////////////////////////////////////////////////////
	// Заполняет параметры конфигурации значениями по умолчанию
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	virtual void PrepareDefaultConfParams(TConfigValues &Values);

	//////////////////////////////////////////////////////////////////////////////////////////////////////
	// Check values of deamon's parameters
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	virtual int ParseParams(TConfigValues &Values);

	//////////////////////////////////////////////////////////////////////////
	// Store setting that always read from local file
	//////////////////////////////////////////////////////////////////////////
	virtual int SetPreAllocConfParams(TConfigValues &Values);

protected:


};

// Автоматический указатель на класс для работы с параметрами
typedef std::auto_ptr<TGivsParametrs>						autoGivsParametrs;


#endif // __INTEGRATOR_PARAMETRS_H__
