#ifndef __INTEGRATOR_SERVER_I_H__
#	define __INTEGRATOR_SERVER_I_H__

#include "Version.h"

#include "Server/BaseServer.h"

//***************************************************************************
// Класс сервера программы
//***************************************************************************
class GivsServer_i : public BaseServer_i
{
public:

	//---------------------------------------------------------------------------
	// Конструктор
	//---------------------------------------------------------------------------
	GivsServer_i(std::string aServerName);

	//---------------------------------------------------------------------------
	// Деструктор
	//---------------------------------------------------------------------------
	~GivsServer_i(void);

	//---------------------------------------------------------------------------
	// Инициализация базы данных
	//---------------------------------------------------------------------------
	virtual int InitDatabase (void);

	//---------------------------------------------------------------------------
	// Инициализация и запуск потоков Listener для клиента с проверкой подписи
	//---------------------------------------------------------------------------
	virtual int InitSignedListener (void);

  //---------------------------------------------------------------------------
  // Инициализация и запуск потоков пула задач сервера
  //---------------------------------------------------------------------------
  virtual int InitSendThread (void);

	//---------------------------------------------------------------------------
	// Инициализация сервера
	//---------------------------------------------------------------------------
	virtual int init (int argc, char** argv);

	//---------------------------------------------------------------------------
	// Запустить сервер
	//---------------------------------------------------------------------------
	virtual int run(void);

	//---------------------------------------------------------------------------
	// Тестирование функций сервера
	//---------------------------------------------------------------------------
	virtual int TestServer (void);

	//---------------------------------------------------------------------------
	// Инициализация и запуск потоков Listener для коммандных запросов
	//---------------------------------------------------------------------------
	int InitServerCommandListener(void);

protected:

	// Фабрика слушалки входящих подписанных соединений клиентов
	IP_Server_Strategy_Factory <GivsSignedListener>		Givs_Signed_Listener_server_factory_;

	// Фабрика слушалки для коммандных запросов
	IP_Server_Strategy_Factory<IntegConsoleListener>	Integ_Command_Listener_server_factory_;

};

#endif // __INTEGRATOR_SERVER_I_H__
